#+BEGIN_COMMENT
.. title: cuDF With emacs-jupyter
.. slug: cudf-with-emacs-jupyter
.. date: 2019-08-10 14:12:42 UTC-07:00
.. tags: cudf,emacs-jupyter,walk-through
.. category: cuDF
.. link: 
.. description: A first trial of cuDF and emacs-jupyter.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
*** CUDF Series
    This runs on the GPU.
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
s = cudf.Series([1, 2, 3, None, 4])
print(s)
#+end_src

#+RESULTS:
: 0    1
: 1    2
: 2    3
: 3     
: 4    4
: dtype: int64
*** dask CUDF
    This also runs on the GPU, but if you have more than one GPU it will use more than one.
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
ds = dask_cudf.from_cudf(s, npartitions=2)
print(ds.compute())
#+end_src

#+RESULTS:
: 0    1
: 1    2
: 2    3
: 3     
: 4    4
: dtype: int64

My machine only has one GPU, so this didn't gain anything, but I do have more than one machine with a GPU so this might help with distributed computing, if I get around to it.
** Data Frames
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
frame = cudf.DataFrame([("a", list(range(10))),
                        ("b", list(range(10)))])
frame["a"] = frame.a * 5
print(frame)
#+end_src

#+RESULTS:
#+begin_example
    a  b
0   0  0
1   5  1
2  10  2
3  15  3
4  20  4
5  25  5
6  30  6
7  35  7
8  40  8
9  45  9
#+end_example
*** From a Pandas DataFrame
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
frame = pandas.DataFrame({"a": list(range(4)), "b": list(range(4, 8))})
frame = cudf.DataFrame.from_pandas(frame)
print(frame)
#+end_src

#+RESULTS:
:    a  b
: 0  0  4
: 1  1  5
: 2  2  6
: 3  3  7
** Selection
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
print(frame[frame.a > 1])
#+end_src

#+RESULTS:
:    a  b
: 2  2  6
: 3  3  7
** Applyng functions
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
frame["a"] = frame.a.applymap(lambda row: row + 5)
print(frame)
#+end_src

#+RESULTS:
:    a  b
: 0  5  4
: 1  6  5
: 2  7  6
: 3  8  7

This is basically the pandas.DataFrame.apply method, but they renamed it for some reason.

** String Methods
#+begin_src jupyter-python :session /ssh:Rapids:.local/share/jupyter/runtime/kernel-2037.json :results output :exports both
series = cudf.Series(["Alpha", "Beta", "GAMMA", "dELTA"])
print(series.str.lower())
#+end_src

#+RESULTS:
: 0    alpha
: 1     beta
: 2    gamma
: 3    delta
: dtype: object

